app/controllers/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" ORDER BY "books"."id" DESC
---
 def index
  @user = User.find(current_user.id)
  @books = Book.all.order(id: "DESC")

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def show
  @book = Book.new
  @books = Book.find(params[:id])
  @user = User.find(@books.user.id)

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-03-25 07:43:31.817868"], ["updated_at", "2020-03-25 07:43:31.817868"], ["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" ORDER BY "books"."id" DESC
---
 def create
  @book = Book.new(book_params)
  @book.user_id = current_user.id
 if @book.save
  redirect_to book_path(@book.id), notice: 'You have creatad book successfully.'
 else
  @user = User.find(current_user.id)
  @books = Book.all.order(id: "DESC")