app/controllers/users_controller.rb

def show
  @user = User.find(params[:id])
  @book = Book.new
  @books = @user.books.all.reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def index
  @book = Book.new
  @user = User.find(current_user.id)
  @users = User.all.order(id: "DESC")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC

def update
  @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]